export const applyDummy = [
  {
    title: "📄 개인정보 수집·이용 동의서",
    content: `
        주식회사 멋쟁이사자처럼은 「정보통신망 이용촉진 및 정보보호에 관한 법률」 및 「개인정보보호법」 등 관련 법령상의 개인정보보호 규정을 준수하여 참가자의 개인정보를 보호합니다.
        <br /><br />
        <b>▣ 개인정보의 수집·이용 목적</b><br />
        개인정보는 본 프로그램 참가 신청, 본인 확인, 프로그램 진행, 안내 및 고지사항 전달 등을 위해 사용됩니다.
        <br /><br />
        <b>▣ 수집하는 개인정보 항목</b><br />
        성명, 연락처, 이메일 등 신청 및 프로그램 운영 중 취득한 정보
        <br /><br />
        <b>▣ 개인정보의 보유·이용기간</b><br />
        개인정보는 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 참여 인정 문서 발급을 위해 5년간 보존됩니다.
      `,
  },
  {
    title: "📌 회비 및 동아리 규정 안내",
    content: `
    인천대학교 멋쟁이사자처럼에서는 <b>한 학기당 20,000원의 회비</b>를 납부해야 합니다.
    <br /><br />
    📌 <b>동아리 규정 미준수 및 벌점 누적</b> 시 경고 조치가 취해지며, <b>벌점이 일정 기준을 초과할 경우 동아리에서 제명</b>될 수 있습니다.
    <br /><br />
    동아리 활동 중 규정을 준수해 주시기 바라며, 함께 즐거운 분위기를 만들어 나가길 기대합니다.
    <br /><br />
    감사합니다.
`,
  },
];
