export const applyDummy = [
  {
    title: "📄 개인정보 수집·이용 동의서",
    content: `
        주식회사 멋쟁이사자처럼은 「정보통신망 이용촉진 및 정보보호에 관한 법률」 및 「개인정보보호법」 등 관련 법령상의 개인정보보호 규정을 준수하여 참가자의 개인정보를 보호합니다.
        <br /><br />
        <b>▣ 개인정보의 수집·이용 목적</b><br />
        개인정보는 본 프로그램 참가 신청, 본인 확인, 프로그램 진행, 안내 및 고지사항 전달 등을 위해 사용됩니다.
        <br /><br />
        <b>▣ 수집하는 개인정보 항목</b><br />
        성명, 연락처, 이메일 등 신청 및 프로그램 운영 중 취득한 정보
        <br /><br />
        <b>▣ 개인정보의 보유·이용기간</b><br />
        개인정보는 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 참여 인정 문서 발급을 위해 5년간 보존됩니다.
      `,
  },
  {
    title: "📌 회비 및 교육비 안내",
    content: `
        멋쟁이사자처럼 <b>본사 규정에 따라</b> 모든 인원은 <b>70,000원을 납부</b>해야 합니다.
        <br /><b>환급이 가능</b>하거나 그대로 제출하는 선택이 주어집니다.
        <br /><br />
        📌 <b>이 사항은 본사 정책에 따라 결정된 사항입니다.</b><br /><br />
        또한, 인천대학교 멋쟁이사자처럼에서는 <b>한 학기당 20,000원의 회비</b>를 납부해야 합니다.
      `,
  },
];
