export const curriculumData = [
  {
    eventKey: "기획/디자인",
    title: "기획/디자인",
    images: ["/curriculum-img/figma.png", "/curriculum-img/notion.png"],
    info: [
      {
        title: "1️⃣ 협업을 위한 필수 툴 학습",
        content:
          "현재 IT 업계에서 가장 주목받는 <strong>Figma</strong>와 <strong>Notion</strong>을 활용하여 기획 및 협업 역량을 키울 수 있어요! <br/> 실시간 협업과 디자인 시스템 구축을 통해 효율적인 팀워크를 경험합니다.",
      },
      {
        title: "2️⃣ 아이디어 시각화",
        content:
          "서비스의 기본 구조를 설계하는 <strong>와이어프레임 구축</strong> 방법을 배우고, 사용자 흐름을 한눈에 파악할 수 있는 <strong>스토리보드 작성</strong>을 통해 기획 단계를 구체화합니다.",
      },
      {
        title: "3️⃣ 문제 해결 능력 및 리더십 역량 증진",
        content:
          "멋쟁이사자처럼 동아리는 아이디어톤, 해커톤 등 <strong>다양한 협업 프로젝트</strong>를 통해 실질적인 경험을 쌓을 수 있는 기회를 제공합니다. <br/> 이러한 활동은 팀 빌딩부터 문제 해결까지의 전 과정을 경험하며, <strong>협업 능력을 효과적으로 강화</strong>할 수 있습니다.",
      },
    ],
  },
  {
    eventKey: "프론트엔드",
    title: "프론트엔드",
    images: [
      "/curriculum-img/w3c.png",
      "/curriculum-img/react.png",
      "/curriculum-img/redux.png",
      "/curriculum-img/typescript.png",
    ],
    info: [
      {
        title: "1️⃣ 웹 개발의 핵심인 W3C 기술",
        content:
          "프론트엔드 개발의 기초인 <strong>HTML, CSS, JavaScript</strong>를 학습하며, 웹 페이지의 구조와 스타일을 설계하고, 동적인 상호작용을 구현합니다. <br/>또한, 더 안전하고 유지보수가 쉬운 코드를 작성하기 위해 <strong>TypeScript</strong>를 함께 학습하여 정적 타입을 활용한 안정적인 개발 방법을 익힙니다. ",
      },
      {
        title: "2️⃣ 트렌디한 웹페이지를 위한 반응형 UI/UX",
        content:
          "<strong>반응형 디자인</strong>은 현대 웹 개발의 필수 기술입니다. 다양한 디바이스(PC, 태블릿, 모바일)에 최적화된 사용자 경험을 제공하기 위해 미디어 쿼리와 플렉스박스, 그리드 레이아웃 같은 CSS 기술을 익힙니다.",
      },
      {
        title: "3️⃣ 전역 상태 관리 기술 학습",
        content:
          "복잡한 웹 애플리케이션에서 상태를 효율적으로 관리하기 위해 <strong>Redux</strong>를 활용한 전역 상태 관리 기술을 학습합니다. <br/>컴포넌트 간 데이터 전달 문제를 해결하고, 대규모 프로젝트에서의 데이터 흐름을 구조적으로 관리할 수 있는 방법을 배웁니다. 이를 통해 개발 생산성을 높이고, 유지보수성을 강화할 수 있는 역량을 키웁니다.",
      },
      {
        title: "4️⃣ API 통신 및 실제 배포 경험",
        content:
          "RESTful API를 활용하여 데이터를 요청하고, 이를 사용자에게 시각적으로 보여주는 기술을 학습합니다. <br/> AWS, Vercel과 같은 배포 도구를 사용해 실제 웹 애플리케이션을 배포하며, 자신의 아이디어를 실현하는 경험을 쌓습니다.",
      },
    ],
  },
  {
    eventKey: "백엔드",
    title: "백엔드",
    images: [
      "/curriculum-img/mySQL.png",
      "/curriculum-img/nodejs.png",
      "/curriculum-img/spring.png",
      "/curriculum-img/aws.png",
    ],
    info: [
      {
        title: "1️⃣ 데이터베이스 설계 및 관리",
        content:
          "백엔드의 기본이 되는 데이터베이스 설계 및 관리를 학습합니다. <strong>MySQL</strong>을 활용하여 데이터를 효과적으로 저장하고 관리하는 방법, 데이터 모델링, 관계형 데이터베이스의 핵심 개념을 이해하며, SQL 쿼리를 통해 데이터를 다루는 기술을 익힙니다.",
      },
      {
        title: "2️⃣ 희망에 따라 선택 가능한 프레임워크 학습",
        content:
          "멋쟁이사자처럼 인천대학교에서는 <strong>Node.js</strong>와 <strong>Spring Boot</strong> 중 본인이 선호하는 프레임워크를 선택하여 학습할 수 있습니다. 각각의 특성과 장단점을 이해하고, 자신에게 맞는 도구를 활용해 백엔드 시스템을 설계합니다.",
      },
      {
        title: "3️⃣ 실무 중심의 프로젝트 및 협업 경험",
        content:
          "백엔드와 프론트엔드 간 원활한 데이터 통신을 위해 <strong>RESTful API</strong>를 설계하고 구현하는 기술을 학습합니다. 협업을 위해 <strong>Notion</strong>과 <strong>Swagger</strong>를 사용하여 API 명세서를 작성하고, 이를 기반으로 데이터 연동 및 테스트를 진행합니다.",
      },
      {
        title: "4️⃣ 클라우드 배포 및 CI/CD 구축",
        content:
          "AWS EC2와 같은 클라우드 서비스를 활용하여 서버를 직접 구성하고 운영하는 방법을 익힙니다. 또한, GitHub Actions, Jenkins와 같은 CI/CD 도구를 활용해 자동화된 배포 환경을 구축하며, 효율적인 개발-배포 워크플로우를 경험합니다.",
      },
    ],
  },
  {
    eventKey: "공통 세션",
    title: "공통 세션",
    images: [
      "/curriculum-img/postman.png",
      "/curriculum-img/github.png",
      "/curriculum-img/slack.png",
    ],
    info: [
      {
        title: "공통 세션은 무엇인가요?",
        content:
          "멋쟁이사자처럼 인천대학교는 2주에 한 번씩 모든 팀원이 협업의 중요성과 프로젝트의 전체적인 방향을 이해할 수 있는 시간인 정기 공통 세션을 진행합니다. <br/> 공통적으로 협업에서 꼭 필요한 <strong>Postman, GitHub, Slack</strong> 같은 협업 도구들을 학습하거나, 각 파트의 진행 상황을 공유하며 협업 중 발생한 문제와 해결 과정을 논의합니다.",
      },
    ],
  },
];

//About Us(왜 멋쟁이사자처럼과 함께 해야할까요?) 더미데이터
export const aboutUsData = [
  {
    imgSrc: "/aboutUs-img/step1.jpg",
    title: "함께 성장하는 분위기",
    content:
      "멋쟁이사자처럼 인천대학교는 모든 부원이 자신의 역량을 키울 수 있도록 동아리 활동 시작과 함께 파트별 스터디를 결성합니다. 경험이 적은 부원들도 함께 학습하며 성장할 수 있는 환경을 제공합니다.",
  },
  {
    imgSrc: "/aboutUs-img/step2.jpg",
    title: "실전 경험을 쌓을 수 있는 기회",
    content:
      "멋쟁이사자처럼에서는 다양한 프로젝트를 통해 실제 개발 환경을 경험할 수 있습니다. 팀 단위로 진행하는 프로젝트는 실력을 쌓는 데에 큰 도움이 되며, 현업에서 요구하는 기술을 직접 배워볼 수 있는 기회를 제공합니다.",
  },
  {
    imgSrc: "/aboutUs-img/step3.png",
    title: "기초부터 심화까지, 체계적인 역량 강화",
    content:
      "멋쟁이사자처럼에서는 기초부터 차근차근 실력을 쌓을 수 있는 스터디를 진행한 후, 심화 트랙 코스에 참여하여 더욱 심도 깊은 기술을 배울 수 있습니다. 각 단계별로 필요한 역량을 강화할 수 있는 기회를 제공하여, 체계적으로 성장할 수 있도록 돕습니다.",
  },
];
// Activity 더미데이터
export const activityData = [
  {
    id: 1,
    imgSrc: "/onboard.jpg",
    title: "아이디어톤",
    text: "멋쟁이사자처럼에서 창의적이고 혁신적인 아이디어를 현실로 구현하는 활동입니다. 참가자들은 팀을 이루어 새로운 아이디어를 기획하고 개발하며, 실질적인 문제 해결 능력을 키웁니다.",
  },
  {
    id: 2,
    imgSrc: "/activity-img/festival.jpeg",
    title: "인천대학교 축제 사이트 제작",
    text: "멋쟁이사자처럼에서는 축제 기간을 활용하여 자신만의 서비스를 출시하고 실제 사용자들과의 유저 테스트를 진행할 수 있는 기회를 제공합니다. 이 과정에서 사용자 피드백을 반영하며, 서비스 개선 방안을 모색하고, 실제 서비스 운영 경험을 통해 실질적인 실무 감각을 익힐 수 있습니다.",
  },
  {
    id: 3,
    imgSrc: "/activity-img/hack.jpeg",
    title: "해커톤",
    text: "멋쟁이사자처럼의 하이라이트인 해커톤은 짧은 시간 안에 프로젝트를 기획하고 개발하며 팀원들과의 협업 역량을 극대화할 수 있는 활동입니다. 제한된 시간 속에서 창의적인 해결책을 도출하며 문제 해결 능력을 강화하고, 성공적인 결과물을 통해 큰 성취감과 자신감을 얻을 수 있습니다.",
  },
  {
    id: 4,
    imgSrc: "/activity-img/session.jpg",
    title: "공통 세션 강의",
    text: "모든 팀원이 함께 참여하여 GitHub와 같은 협업 툴의 활용법과 공통적으로 알아두면 좋은 협업 지식을 학습하고 공유하는 시간입니다. 이 세션을 통해 각 파트의 진행 상황을 투명하게 공유하며, 협업 과정에서 발생할 수 있는 문제를 효과적으로 해결하는 방법을 익히고 실질적인 협업 역량을 키울 수 있습니다.",
  },
];
// Question 더미데이터
export const questionData = [
  {
    id: 1,
    question: "멋쟁이사자처럼은 어떤 동아리인가요?",
    answer:
      "멋쟁이사자처럼은 2013년에 창립된 IT 개발 동아리로, 대학생들이 모여 다양한 프로젝트와 실무 경험을 쌓는 곳입니다. 매년 다양한 IT 관련 서비스와 프로젝트를 출시하며, 현재는 전국 150개 이상의 대학에서 활동하고 있습니다. 비전공자도 참여 가능하며, 기술 수준에 상관없이 누구나 배울 수 있는 환경을 제공합니다.",
  },
  {
    id: 2,
    question: "멋쟁이사자처럼 동아리에서는 개발 공부만 하나요?",
    answer:
      "개발 공부뿐만 아니라, 동아리 내에서 친목 활동도 활발히 이루어집니다. 특히 인천대 멋쟁이사자처럼은 MT나 축제 기간 동안 팀원들과 유대감을 쌓으며 즐겁게 시간을 보냅니다. 학술 동아리라고 해서 공부만 하는 것이 아니라, 공부와 재미를 동시에 즐길 수 있는 분위기가 형성되어 있습니다.",
  },
  {
    id: 3,
    question: "개발 경험이 부족해서 걱정되는데, 괜찮을까요?",
    answer:
      "개발 경험이 부족해도 전혀 문제되지 않습니다! 멋쟁이사자처럼은 개발에 대한 열정과 배우려는 마음이 가장 중요합니다. 실제로 비전공자들도 많이 활동하고 있으며, 다양한 교육 프로그램과 실습을 통해 실력을 키울 수 있습니다. 경험보다는 도전 정신과 끈기가 중요하니, 걱정 마시고 도전해 보세요!",
  },
  {
    id: 4,
    question: "모집 일정이 어떻게 되나요?",
    answer:
      "아래 내용을 확인해주세요.<br/><br/>📌 <strong>모집 일정</strong><br/>- 02.10(월) 00시 00분 ~ 02.19(수) 23시 59분 : 서류 접수<br/>- 02.23(일) : 서류 합격자 발표<br/>- 02.27(목) ~ 03.02(일) : 면접 진행<br/>- 03.04(화) : 최종 합격자 발표<br/><br/>📌 <strong>면접 관련 공지</strong><br/>면접은 2월 27(목), 28(금), 3월 1일(토), 3월 2일(일) 중에서 본인이 희망하는 날짜와 시간으로 면접을 진행할 수 있습니다. 대면 면접으로 진행될 예정이오나, 불가피한 상황이신 분에 한해서 화상 면접도 가능합니다.<br/><br/>📌 <strong>활동 기간</strong><br/>- 2025년 3월 ~ 12월",
  },
];

//연간일정 더미데이터
export const scheduleEvents = [
  {
    month: "2월",
    events: [
      {
        title: "아기사자 모집",
        description: "지원자들의 열정과 잠재력을 평가하는 중요한 기간",
      },
    ],
  },
  {
    month: "5월",
    events: [
      {
        title: "아이디어톤",
        description: "혁신적인 아이디어 발굴 및 초기 프로토타입 개발",
      },
    ],
  },
  {
    month: "8월",
    events: [
      {
        title: "해커톤",
        description: "팀별 집중 개발 및 실제 프로젝트 구현",
      },
    ],
  },
  {
    month: "10월",
    events: [
      {
        title: "트랙별 역량 강화",
        description: "전문 멘토와 함께하는 심화 워크샵",
      },
    ],
  },
  {
    month: "12월",
    events: [
      { title: "데모데이", description: "최종 프로젝트 발표 및 성과 공유" },
    ],
  },
  {
    month: "26년 2월",
    events: [
      {
        title: "실리콘밸리 기업 탐방",
        description: "우수 활동자 해외 선진 기업 탐방",
      },
    ],
  },
];
